todo-api/app/controllers/api/v1/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY "todos"."created_at" DESC
---
  def index
    @todos = Todo.all.order(created_at: :desc)

INSERT INTO "todos" ("title", "is_completed", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "dd"], ["is_completed", 0], ["created_at", "2025-06-05 03:34:04.513260"], ["updated_at", "2025-06-05 03:34:04.513260"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save

UPDATE "todos" SET "is_completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["is_completed", 1], ["updated_at", "2025-06-05 03:56:02.061549"], ["id", 19]]
---
  def update
    if @todo.update(todo_params)